//CUSTDATA JOB (FB3),'GENERATE ADATA',CLASS=A,MSGCLASS=H,
//         NOTIFY=&SYSUID,MSGLEVEL=(1,1)
//*
//* Copyright IBM Corp. 2023
//*
//* JCL to compile CUSTOMER copybook and generate ADATA file
//* for IBM Record Generator for Java
//*
//GENADATA EXEC PGM=IGYCRCTL,REGION=0M,
//            PARM=(NODYNAM,LIB,RENT,LIST,MAP,XREF,ADATA)
//STEPLIB  DD DSN=PP.COBOL390.V640.SIGYCOMP,DISP=SHR
//         DD DISP=SHR,DSN=ANTZ.CICS.TS.DEV.INTEGRAT.SDFHLOAD
//SYSLIB   DD DISP=SHR,DSN=IN0050.CBSA.DSECT
//         DD DISP=SHR,DSN=PP.ADLE370.ZOS301.SCEESAMP
//         DD DISP=SHR,DSN=ANTZ.CICS.TS.DEV.INTEGRAT.SDFHCOB
//SYSPRINT DD SYSOUT=*
//SYSADATA DD DSN=IN0050.CBSA.ADATA(CUSTOMER),DISP=SHR
//SYSUT1   DD UNIT=SYSALLDA,SPACE=(TRK,(350,100))
//SYSUT2   DD UNIT=SYSALLDA,SPACE=(TRK,(350,100))
//SYSUT3   DD UNIT=SYSALLDA,SPACE=(TRK,(350,100))
//SYSUT4   DD UNIT=SYSALLDA,SPACE=(TRK,(350,100))
//SYSUT5   DD UNIT=SYSALLDA,SPACE=(TRK,(350,100))
//SYSUT6   DD UNIT=SYSALLDA,SPACE=(TRK,(350,100))
//SYSUT7   DD UNIT=SYSALLDA,SPACE=(TRK,(350,100))
//SYSUT8   DD UNIT=SYSALLDA,SPACE=(TRK,(350,100))
//SYSUT9   DD UNIT=SYSALLDA,SPACE=(TRK,(350,100))
//SYSUT10  DD UNIT=SYSALLDA,SPACE=(TRK,(350,100))
//SYSUT11  DD UNIT=SYSALLDA,SPACE=(TRK,(350,100))
//SYSUT12  DD UNIT=SYSALLDA,SPACE=(TRK,(350,100))
//SYSUT13  DD UNIT=SYSALLDA,SPACE=(TRK,(350,100))
//SYSUT14  DD UNIT=SYSALLDA,SPACE=(TRK,(350,100))
//SYSUT15  DD UNIT=SYSALLDA,SPACE=(TRK,(350,100))
//SYSMDECK DD UNIT=SYSALLDA,SPACE=(TRK,(350,100))
//SYSIN    DD *
       PROCESS ADATA
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CUSTCOPY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY CUSTOMER.
       PROCEDURE DIVISION.
           STOP RUN.
/*